In [1]:
# Uzdevums:
# Izdzēsiet iepriekšējā nodarbībā izveidoto datubāzi 'trenins' un izveidojiet datubāzi 'dati'

In [2]:
import pandas as pd
import getpass
from sqlalchemy import create_engine
import MySQLdb
check = False

In [3]:
class MySQLConnection:
    def __init__(self,user,hostname,db):
        self.user = str(user)
        self.hostname = str(hostname)
        self.db = str(db)
        pword = getpass.getpass("Enter password for user {}".format(user))
        # self.cnx = mysql.connector.connect(host=self.hostname,user=self.user, password=pword,database=self.db)
        self.engine = create_engine("mysql+mysqlconnector://{}:{}@{}/{}".format(user,pword,hostname,db))
        self.cnx = self.engine.connect()
    
    def write_to_db(self, df, table_name):
        try:
            df.to_sql(table_name,con = self.cnx,if_exists='append',index=False)
        except Exception as e:
            print("\n SQL Write error with: ")
            print(df,"\n", e)
    
    def query(self,q):
        try:
            pd.read_sql(q,self.cnx)
        except:

In [4]:
sql = MySQLConnection('ubuntu','localhost','dati')

Enter password for user ubuntu········

In [5]:
a_code = pd.read_csv('access-code.csv',';')
a_code_pword_rec = pd.read_csv('access-code-password-recovery-code.csv',sep=';')
un_pw_rec_code = pd.read_csv('username-password-recovery-code.csv',sep=';')
un = pd.read_csv('username.csv',sep=';')
email = pd.read_csv('email.csv',sep=';')
un_email = pd.read_csv('username-or-email.csv',sep=';')
email_pw_rec = pd.read_csv('email-password-recovery-code.csv',sep=';')

In [6]:
a_code.columns = ['Identifier', 'Firstname','Lastname']
a_code_pword_rec.columns = ['Identifier','Accesscode','Recoverycode','Firstname','Lastname','Department','Location']
un_pw_rec_code.columns = ['Username','Identifier','Onetimepassword','Recoverycode','Firstname','Lastname','Department','Location']
un.columns = ['Username', 'Identifier', 'Firstname','Lastname']
email.columns = ['Loginemail','Identifier', 'Firstname','Lastname']
un_email.columns = ['Username','Loginemail','Identifier', 'Firstname','Lastname']
email_pw_rec.columns = ['Loginemail','Identifier','Onetimepassword','Recoverycode', 'Firstname','Lastname','Department','Location']

In [7]:
# ŠĪ ŠŪNA JĀIZPILDA VIENREIZ!

if not check:
    sql.write_to_db(a_code,'access_code')
    sql.write_to_db(a_code_pword_rec,'access_code_password_recovery_code')
    sql.write_to_db(un_pw_rec_code,'username_password_recovery_code')
    sql.write_to_db(un,'username')
    sql.write_to_db(email,'email')
    sql.write_to_db(un_email,'username_or_email')
    sql.write_to_db(email_pw_rec,'email_password_recovery_code')
    check = True

In [ ]:
select_query_template = """ 
SELECT 
    Username, 
    Identifier 
FROM 
    username_or_email 
WHERE 
    identifier > 4000
ORDER BY 
    identifier DESC 
LIMIT 3
"""

pd.read_sql(select_query_template, sql.cnx)

In [ ]:
grouping_query_template = """
select
    Location,
    count(*) 
from 
    username_password_recovery_code 
group by 
    Location
"""
# username_password_recovery_code
pd.read_sql(grouping_query_template, sql.cnx)

In [ ]:
join_query_template = """
select
    username.username,
    email.Identifier
from 
    username inner join email on 
    username.Identifier = email.Identifier
"""

pd.read_sql(join_query_template, sql.cnx)

In [ ]:
# Uzdevums:
# Izveidojiet jaunu mysql lietotāju 'hr', kuram ir pieeja tikai uz datubāzi dati un tabulām 'email' un 'username_or_email'

# CREATE TABLE  
Šie divi atslēgvārdi izveido tabulu ar fiksētu kolonnu skaitu un fiksētiem kolonnu vērtību tipiem.  
Piemērs:  
CREATE TABLE Tabula1 (Kolonna1 Int, Kolonna2 Int, Kolonna3 char)

In [9]:
izveidosanas_vaicajums = """
create table tabula1(kolonna1 int , kolonna2 int, kolonna3 char)
"""

# pd.read_sql(izveidosanas_vaicajums, sql.cnx)

# SELECT atslēgvārds  
SELECT atslēgvārds atlasa kolonnas. Select atslēgvārdam ir jābūt jebkurā SQL vaicājumā. Select kā argumentus ņem vai nu attiecīgās tabulas kolonnas vai arī īpašu argumentu * , kas atlasa visas kolonnas

In [11]:
select_vaicajums = """
select * from email
"""
pd.read_sql(select_vaicajums, sql.cnx)

          Loginemail  Identifier Firstname Lastname
0  laura@example.com        2070     Laura     Grey
1  craig@example.com        4081     Craig  Johnson
2   mary@example.com        9346      Mary  Jenkins
3  jamie@example.com        5079     Jamie    Smith

# FROM atslēgvārds  
Tāpat kā SELECT, arī FROM atslēgvārds ir atrodams jebkurā SQL vaicājumā. Loģika aiz šī ir tāda, ka mēs vienmēr ņemam kādas kolonnas no kādas tabulas.  
**Visas kolonnas vienmēr tiek ņemtas no kādas tabulas, neatkarīgi no tā vai tabula ir jau esoša vai tiek izveidota kāda cita vaicājuma rezultātā.**

# WHERE atslēgvārds  
**WHERE atslēgvārds NAV obligāts. WHERE atslēgvārds tiek izmantots, lai atlasītu rindas, kuras atbilst 'būla mainīgā' apgalvojumam piem:**  

SELECT  
  Kolonna1,  
  Kolonna2  
FROM Tabula1  
WHERE Kolonna1 > 10  

**WHERE atslēgvārdam var padot vairākus argumentus, kurus var apvienot ar AND piem:**

SELECT  
  Kolonna1,  
  Kolonna2  
FROM Tabula1  
WHERE Kolonna1 > 10  AND Kolonna2 < 4

In [15]:
a = 4
b = 5

d = 6
e = 7

f = d == e
c = a == b 

f and c

False

# ORDER BY funkcija/atslēgvārdi  
Order by funkcija SQL vaicājumā vienmēr būs pēc WHERE atslēgvārda, bet pirms LIMIT, ja tāds tiek lietots. Sakārto tabulu vai nu augoši vai dilstoši. Piemērs:  
SELECT * FROM Tabula1 ORDER BY <kolonnas_nosaukums> <asc/desc>

In [18]:
order_vaicajums = """
select * from email order by identifier desc
"""

pd.read_sql(order_vaicajums, sql.cnx)

          Loginemail  Identifier Firstname Lastname
0   mary@example.com        9346      Mary  Jenkins
1  jamie@example.com        5079     Jamie    Smith
2  craig@example.com        4081     Craig  Johnson
3  laura@example.com        2070     Laura     Grey

# Tabulas var veidot arī ar SELECT atslēgvārdu  
**Izmantojot CREATE TABLE, tipiski ir jānorāda tabulas nosaukums, kolonnu nosaukumi un to tipi, bet izveidot tabulu var arī ar sekojošo sintaksi:**  

CREATE TABLE skelums AS SELECT Kolonna1, Kolonna2  
FROM Tabula1  

**Šis strādā, jo, ja mēs atsaucamies uz eksistējošu tabulu, tās kolonnām jau ir gan nosaukumi, gan tipi un tie nav jānorāda vēlreiz**

In [ ]:
# Uzdevums:
# 1. Ar select <kolonnas> from <tabula>' izpētiet tabulas 'email' un 'username', 
# 2. Izveidojiet tabulu username_sample no tabulas username, kurā ir tikai kolonnas 'Identifier' un 'username' tikai 
# no tiem darbiniekiem, kuriem Identificator ir lielāks par 4000

In [24]:
# uzdevums = """
# create table username_sample as select Identifier, username from username where Identifier > 4000
# """

uzdevums = """
select 
    * 
from 
    username_sample
"""

pd.read_sql(uzdevums,sql.cnx)

   Identifier   username
0        9012   booker12
1        4081  johnson81
2        9346  jenkins46
3        5079    smith79

# Agregācijas funkcijas: COUNT, SUM, MIN, MAX, AVG

In [28]:
agr_skaita_vaicajums = """
select count(distinct(firstname)) from email where identifier > 4000
"""
pd.read_sql(agr_skaita_vaicajums,sql.cnx)

   count(distinct(firstname))
0                           3

In [33]:
agr_sum_vaicajums = """
select sum(*) from email
"""

# agr_sum_vaicajums = """
# select sum(loginemail) from email
# """

agr_sum_vaicajums = """
select sum(Identifier) from email
"""

# agr_sum_vaicajums = """
# select count from email
# """

pd.read_sql(agr_sum_vaicajums,sql.cnx)

   sum(Identifier)
0          20593.0

In [35]:
agr_sum_vaicajums = """
select max(Identifier) from email
"""

pd.read_sql(agr_sum_vaicajums,sql.cnx)

   max(Identifier)
0             9346

In [ ]:
agr_sum_vaicajums = """
select count(*) from email
"""
pd.read_sql(agr_sum_vaicajums,sql.cnx)

# JOIN atslēgvārds  
Viena no spēcīgākajām SQL iespējām ir salīdzinoši vienkāršā tabulu sapludināšana.  
JOIN atslēgvārds izveido jaunu tabulu no divām citām tabulām, apvienojot rindiņas.  
Rindiņas tiek apvienotas izmantojot kādas norādītas kolonnas vērtības.  
**Svarīgi: JOIN atslēgvārds tabulas izveido, bet lai kaut kas tiktu atgriezts, vaicājumam tāpat ir jāsatur SELECT.**  
Piemērs:  
SELECT < kolonnas > FROM <join apgalvojums šeit>

Ir 4 apvienošanas stratēģijas 'inner', 'outer', 'left' un 'right'

In [ ]:
# Uzdevums:
# Sekojošajā piemērā izstājiet atslēgvārdu 'inner' ar secīgi 'outer', 'left' un 'right'. Ko var secināt?

join_query_template = """
select
    username_sample.username,
    email.Identifier
from 
    username_sample inner join email on 
    username_sample.Identifier = email.Identifier
"""

pd.read_sql(join_query_template, sql.cnx)

![alt text](http://codinghelptech.com/blog_post/Sql-Join.png "Logo Title Text 1")
<!-- http://codinghelptech.com/Database/Sql-Join.html -->

In [ ]:
# Uzdevums / MAJAS DARBS:
# Izveidojiet tabulu, kurā ir TIKAI visu lietotāju lietotājvārdi e-pasti un atrašanās vietas,
# izmantojot tikai tabulas, kuras iegūtas no uzskaititajiem failiem. Mums interese tikai ieraksti, kur nekas netrukst.
# 1. email.csv
# 2. username-password-recovery-code.csv

# GROUP BY atslēgvārds  
<!-- https://www.w3schools.com/sql/sql_groupby.asp-->
GROUP BY atslēgvārds ir komanda, kas ir nevis paredzēts lai filtrētu vai atgrieztu tabulas, bet gan lai sagrupētu tabulas pēc kādas kolonnas unikālajām vērtībām.